package lesson019._06_set;

import java.util.HashSet;

public class Main {
    public static void main(String[] args) {
        //Set - коллекции позволяющие хранить множетсво уникальных элементов
        //HashSet - класс под капотом реализация принципа хеш таблицы
        //LinkedHashSet - класс под капотом реализация принципа хеш таблицы, но
        //при этом элементы представляют собой связанный список(элементы имеют ссылку на след
        // добавленный элемент)
        //TreeSet - класс под капотом реализация принципа красно черного дерево

    }
}
