package lesson019._01_collections;

import java.util.Collection;
import java.util.List;

public class Main {
    public static void main(String[] args) {
        //для хранения множества данных можно использовать
        //обычные массивы
        //недостатки:
        //1) масив это объект котрорый имеет четкий размер, его нельзя изменить
        //2) нет удобных методов, например для добавления или удаления элементов
        int[] arr = new int[10];
        //для удобного хранения множества данных используют коллекции -
        //набор интерфейсов и реализующих их классов

        //Iterable - означает что объекты реализуеющихя классов являются итерируемыми
        //(перебираемыми циклом foreach)



    }
}
